package com.getjavajob.bunyatt.controller;

public class AccountController {
    //todo в контроллере реализуется информация по транзакции.
    //todo Эту информацию берем из ДАО классов.
    //todo Например нам надо сделать сложную транзакцию, которая заденет несколько простых
    //todo Тогда нужно запилить метод контроллера который дернет несколько методов ДАО
    //todo
    //todo Контроллер должен начинать транзакцию, потом лазить по даошкам
    //todo Пущай миллион раз или рекунсивно. И только потом закрыть транзакцию.
    //todo Так сказать контроллер это обертка интерфейса над ДАО
    //todo
}
